tutorials/sideInjection_simple/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(

  {
    name inlet.particles;
    type faceSet;
    action new;
    source boxToFace;
    sourceInfo
    {
        box  (0.1499 0.1 -99) (99 0.20 99);
    }
   }

   {
    name outlet;
    type faceSet;
    action new;
    source boxToFace;
    sourceInfo
    {
        box  (0.1499 0.80 -99) (99 0.9 99);
    }
   }
);
